# Incoming Instapay Transactions

## Pre-Processing

### Data Acquisition
Imported the dataset and converted it from .xslx to .csv.

In [11]:
import pandas as pd
import numpy as np

In [12]:
df1 = pd.read_excel("C:/Users/daeni/Desktop/LOVE/PJDSC2023-CarpeDatum/PJDSC2023-CarpeDatum/Dataset/INCOMING INSTAPAY TXNS_PJDSC.xlsx")

In [13]:
df1.to_csv('INCOMING INSTAPAY TXNS_PJDSC')

---

### First and last values of the dataframe

In [14]:
df1.head()

      CUST_NUM       DATE   TIME        AMOUNT BPI_ACCT_TYPE SRC_BANK_NAME
0  5713.401964 2023-04-01  73591  12299.238264            SA         LEMUR
1  5713.401964 2023-04-05  44714   2499.424915            SA         HUMAN
2  5713.401964 2023-04-24  46302    748.744684            SA         HUMAN
3  5713.401964 2023-04-29  40612   1799.144167            SA         HUMAN
4  5713.401964 2023-04-29  24021   1499.628880            SA         HUMAN

In [15]:
df1.tail()

           CUST_NUM       DATE   TIME       AMOUNT BPI_ACCT_TYPE SRC_BANK_NAME
80037  11432.368259 2023-06-30  76309  2998.982229            SA         HUMAN
80038   9868.617026 2023-06-30  38348  7499.457892            SA         HUMAN
80039   9868.617026 2023-06-30  38465    19.806571            SA         HUMAN
80040  13968.861156 2023-06-30  51968   999.240763            SA         HUMAN
80041   5523.664001 2023-06-30  65503  9999.146908            SA           DOG

---

### Number of rows and columns in the dataframe

In [16]:
df1.shape

(80042, 6)

---

### Finding Missing Values

In [17]:
df1.isna().head()

   CUST_NUM   DATE   TIME  AMOUNT  BPI_ACCT_TYPE  SRC_BANK_NAME
0     False  False  False   False          False          False
1     False  False  False   False          False          False
2     False  False  False   False          False          False
3     False  False  False   False          False          False
4     False  False  False   False          False          False

In [18]:
df1.isna().sum()

CUST_NUM         0
DATE             0
TIME             0
AMOUNT           0
BPI_ACCT_TYPE    0
SRC_BANK_NAME    0
dtype: int64

In [41]:
df1.isnull().head()

   CUST_NUM   DATE   TIME  AMOUNT  BPI_ACCT_TYPE  SRC_BANK_NAME
0     False  False  False   False          False          False
1     False  False  False   False          False          False
2     False  False  False   False          False          False
3     False  False  False   False          False          False
4     False  False  False   False          False          False

In [38]:
df1.isnull().sum()

CUST_NUM         0
DATE             0
TIME             0
AMOUNT           0
BPI_ACCT_TYPE    0
SRC_BANK_NAME    0
dtype: int64

**Findings:** There are no missing values for this dataframe.

---

### Basic Insights

In [29]:
df1.dtypes

CUST_NUM                float64
DATE             datetime64[ns]
TIME                      int64
AMOUNT                  float64
BPI_ACCT_TYPE            object
SRC_BANK_NAME            object
dtype: object

In [33]:
df1.describe()

           CUST_NUM          TIME        AMOUNT
count  80042.000000  80042.000000  80042.000000
mean    9529.540598  49665.994703   7222.707496
std     3318.957803  18565.417174   9930.187824
min       85.229103      0.000000      0.000000
25%     7263.799281  36280.000000   1399.106327
50%    10115.793790  50135.500000   3499.219629
75%    12362.797499  63988.000000   8899.650838
max    14140.490939  86395.000000  50000.127465

In [34]:
df1.describe(include="all")

C:\Users\daeni\AppData\Local\Temp\ipykernel_19692\4174339788.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df1.describe(include="all")

,CUST_NUM,DATE,TIME,AMOUNT,BPI_ACCT_TYPE,SRC_BANK_NAME
count,80042.000000,80042,80042.000000,80042.000000,80042,80042
unique,NaN,91,NaN,NaN,2,49
top,NaN,2023-05-31 00:00:00,NaN,NaN,SA,HUMAN
freq,NaN,1214,NaN,NaN,79248,41404
first,NaN,2023-04-01 00:00:00,NaN,NaN,NaN,NaN
last,NaN,2023-06-30 00:00:00,NaN,NaN,NaN,NaN
mean,9529.540598,NaN,49665.994703,7222.707496,NaN,NaN
std,3318.957803,NaN,18565.417174,9930.187824,NaN,NaN
min,85.229103,NaN,0.000000,0.000000,NaN,NaN
25%,7263.799281,NaN,36280.000000,1399.106327,NaN,NaN
50%,10115.793790,NaN,50135.500000,3499.219629,NaN,NaN
75%,12362.797499,NaN,63988.000000,8899.650838,NaN,NaN
max,14140.490939,NaN,86395.000000,50000.127465,NaN,NaN

In [35]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80042 entries, 0 to 80041
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   CUST_NUM       80042 non-null  float64
 1   DATE           80042 non-null  datetime64[ns]
 2   TIME           80042 non-null  int64
 3   AMOUNT         80042 non-null  float64
 4   BPI_ACCT_TYPE  80042 non-null  object
 5   SRC_BANK_NAME  80042 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(2)
memory usage: 3.7+ MB

---

## Data Wrangling

### Convert data types to proper format

In [54]:
# Convert time to the proper format. I dont know why its integers.

### Breaking Down Categorical Variables

For the BPI Account Type:

In [71]:
dummy_variable_1 = pd.get_dummies(df1["BPI_ACCT_TYPE"])
dummy_variable_1.rename(columns={'CA':'ACCT-TYPE-CA', 'SA':'ACCT-TYPE-SA'}, inplace=True)
dummy_variable_1

       ACCT-TYPE-CA  ACCT-TYPE-SA
0                 0             1
1                 0             1
2                 0             1
3                 0             1
4                 0             1
...             ...           ...
80037             0             1
80038             0             1
80039             0             1
80040             0             1
80041             0             1

[80042 rows x 2 columns]

In [72]:
df1 = pd.concat([df1, dummy_variable_1], axis=1)
df1.drop("BPI_ACCT_TYPE", axis = 1, inplace=True)

For the Source Bank Name:

In [86]:
pd.set_option('display.max_columns', None)

In [113]:
dummy_variable_1 = pd.get_dummies(df1["SRC_BANK_NAME"])
dummy_variable_1.head(1)

,ANTELOPE,BADGER,BAT,BEAR,BOBCAT,CAMEL,CAT,CHEETAH,CHIMPANZEE,COUGAR,DEER,DOG,DOLPHIN,ELEPHANT,EMU,GIRAFFE,GORILLA,HEDGEHOG,HORSE,HUMAN,HYENA,IBEX,JACKAL,KANGAROO,KOALA,LEMUR,LION,LYNX,MARMOSET,MEERKAT,MONGOOSE,MONKEY,MOOSE,OSTRICH,OTTER,RABBIT,RACCOON,SEAL,SERVAL,SHREW,SKUNK,SLOTH,SQUIRREL,TAPIR,TIGER,VOLE,WHALE,WOLF,ZEBRA
0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0

In [112]:
dummy_variable_1_columns = dummy_variable_1.iloc[0]
dummy_variable_1_columns

ANTELOPE      0
BADGER        0
BAT           0
BEAR          0
BOBCAT        0
CAMEL         0
CAT           0
CHEETAH       0
CHIMPANZEE    0
COUGAR        0
DEER          0
DOG           0
DOLPHIN       0
ELEPHANT      0
EMU           0
GIRAFFE       0
GORILLA       0
HEDGEHOG      0
HORSE         0
HUMAN         0
HYENA         0
IBEX          0
JACKAL        0
KANGAROO      0
KOALA         0
LEMUR         1
LION          0
LYNX          0
MARMOSET      0
MEERKAT       0
MONGOOSE      0
MONKEY        0
MOOSE         0
OSTRICH       0
OTTER         0
RABBIT        0
RACCOON       0
SEAL          0
SERVAL        0
SHREW         0
SKUNK         0
SLOTH         0
SQUIRREL      0
TAPIR         0
TIGER         0
VOLE          0
WHALE         0
WOLF          0
ZEBRA         0
Name: 0, dtype: uint8

In [114]:
dummy_variables_1_old_colname = ['ANTELOPE', 'BADGER', 'BAT', 
                                'BEAR', 'BOBCAT', 'CAMEL',
                                'CAT', 'CHEETAH', 'CHIMPANZEE',  
                                'COUGAR', 'DEER', 'DOG', 
                                'DOLPHIN', 'ELEPHANT', 'EMU', 
                                'GIRAFFE', 'GORILLA', 'HEDGEHOG'
                                'HORSE', 'HUMAN', 'HYENA', 
                                'IBEX', 'JACKAL', 'KANGAROO',
                                'KOALA', 'LEMUR', 'LION', 
                                'LYNX', 'MARMOSET', 'MEERKAT', 
                                'MONGOOSE', 'MONKEY', 'MOOSE', 
                                'OSTRICH', 'OTTER', 'RABBIT',
                                'RACCOON', 'SEAL', 'SERVAL',
                                'SHREW', 'SKUNK', 'SLOTH',
                                'SQUIRREL', 'TAPIR', 'TIGER',
                                'VOLE', 'WHALE', 'WOLF',
                                'ZEBRA'
                               ]
set_prefix = 'SRC-'
column_mapping = {dummy_variables_1_old_colname: set_prefix + dummy_variables_1_old_colname for colname in dummy_variables_1_old_colname}

TypeError: can only concatenate str (not "list") to str

In [ ]:
dummy_variable_1.rename(columns={'ANTELOPE':'SRC-ANTELOPE', 
                                 'BADGER':'SRC-BADGER', 
                                 'BAT':'SRC-BAT', 
                                 'BEAR':'SRC-BEAR', 
                                 'BOBCAT':'SRC-BOBCAT', 
                                 'CAMEL':'SRC-CAMEL', 
                                 'CAT':'SRC-CAT', 
                                 'CHEETAH':'SRC-CHEETAH', 
                                 'CHIMPANZEE':'SRC-CHIMPANZEE', 
                                 'COUGAR':'SRC-COUGAR', 
                                 'DEER':'SRC-DEER', 
                                 'DOG':'',
                                 'DOLPHIN':'',
                                 'ELEPHANT':'',
                                 'EMU':'',
                                 'GIRAFFE':'',
                                 'GORILLA':'',
                                 'HEDGEHOG':'',
                                 'HORSE':'',
                                 'HUMAN':'',
                                 'HYENA':'',
                                 'IBEX':'',
                                 'JACKAL':'',
                                 'KANGAROO':'',
                                 'KOALA':'',
                                 'LEMUR':'',
                                 'LION':'',
                                 'LYNX':'',
                                 'MARMOSET':'',
                                 'MEERKAT':'',
                                 'MONGOOSE':'',
                                 '':'',
                                 '':'',
                                 '':'',
                                 '':'',
                                 '':'',
                                }, inplace=True)